app/views/tasks/_form.html.erb


    <!-- <%= render partial: 'category', collection: Category.all  %> -->
---
SELECT "categories".* FROM "categories"