app/views/tasks/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = $1  [["task_id", 13]]
---
          <td>
            <% task.category.each do |cat| %>