app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "A manually created list!"], ["created_at", "2015-05-27 01:21:43.451675"], ["updated_at", "2015-05-27 01:21:43.451675"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

UPDATE "lists" SET "name" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["name", "Shopping list"], ["updated_at", "2015-05-28 02:19:56.964895"], ["id", 1]]
---
  def update
    if @list.update_attributes(list_params)

SELECT "tasks".* FROM "tasks" WHERE (due_at < '2015-05-28 02:02:01.200920') AND (due_at < '2015-06-04 02:02:01.201207')
---
  def due_this_week
    @tasks = Task.all.pending.due_within(1.week.from_now)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 8]]
---
    def find_list
      @list = List.find(params[:id])