app/controllers/tasks_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."task_id" = $1 LIMIT 1  [["task_id", 8]]
---
  def edit
    @task.build_link unless @task.link.present?

INSERT INTO "tasks" ("description", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "hand-typed task"], ["list_id", 8], ["created_at", "2015-05-27 01:21:58.813985"], ["updated_at", "2015-05-27 01:21:58.813985"]]
---
  def create
    @task = Task.new(task_params)
    if @task.valid?
      @list.tasks << @task

UPDATE "tasks" SET "due_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["due_at", "2015-06-24 00:00:00.000000"], ["updated_at", "2015-05-28 05:33:33.099013"], ["id", 1]]
---
  def update
    if @task.update_attributes(task_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 8]]
---
    def find_list
      @list = List.find(params[:list_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1 AND "tasks"."id" = $2 LIMIT 1  [["list_id", 2], ["id", 13]]
---
    def find_task
      @task = @list.tasks.find(params[:id])